let mes = "Hello world";

// звичайний підхід
// в умові не вказано, яким методом виводить на екран,
// через консоль чи вспливаючим повідомленням

// варіант 1
/**/
for (let i = 1; i <= 10; i++) {
    console.log(`${i}: ` + mes);
    alert(`${i}: ` + mes);
}
/**/

// варіант 2
// фігурні дужки обмежують область видимості змінної,
// так використовують в C# щоб не викликати Garbage Collector
// тобто, очищення змінної
/*
{
    let i = 0;
    while (++i <= 10) {
        console.log(`${i}: ` + mes);
        alert(`${i}: ` + mes);
    }
}
*/

// варіант 3
/*
{
    let i = 1;
    do {
        console.log(`${i}: ` + mes);
        alert(`${i}: ` + mes);
    } while (++i <= 10);
}
*/
