// Поменйте цикл for на цикл while не меняя поведение сценария.

/*
for (let i = 0; i < 5; i++) {
    console.log(`значение ${i}`);
}
*/

// через цикл while
{
    let i = 0;
    while (i < 5) {
        console.log(`значение ${i++}`);
        // можна і так:
        // i++;
        // але так ефективніше використовується простір
    }
}

// Примітка. додаткові фігурні дужки обмежують область
// видисоті змінних

// через цикл do while
/*
{
    let i = 0;
    do {
        console.log(`значение ${i++}`);
    } while (i < 5);
}
*/